
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/11878820199)



<pre><code>Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/release.yml&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tokei-toukei"].github_repository.this: Refreshing state... [id=tokei-toukei]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["tokei-toukei"].github_branch_default.this: Refreshing state... [id=tokei-toukei]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["tokei-toukei"].github_repository_ruleset.this: Refreshing state... [id=2639488]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["tokei-toukei"].github_issue_label.this["deps"]: Refreshing state... [id=tokei-toukei:deps]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["tokei-toukei"].github_issue_label.this["maintenance"]: Refreshing state... [id=tokei-toukei:maintenance]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["feature"]: Refreshing state... [id=tokei-toukei:feature]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["tokei-toukei"].github_issue_label.this["documentation"]: Refreshing state... [id=tokei-toukei:documentation]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["breaking"]: Refreshing state... [id=tokei-toukei:breaking]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["tokei-toukei"].github_issue_label.this["refactor"]: Refreshing state... [id=tokei-toukei:refactor]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["bugfix"]: Refreshing state... [id=tokei-toukei:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["json-with-comments"].data.github_repository_file.default_readme: Reading...
module.repositories["tokei-toukei"].data.github_repository_file.default_readme: Reading...
module.repositories["devcontainer-features"].data.github_repository_file.default_readme: Reading...
module.repositories["tfgh"].data.github_repository_file.default_readme: Reading...
module.repositories["dyson-rs"].data.github_repository_file.default_readme: Reading...
module.repositories["json-with-comments"].data.github_repository_file.default_readme: Read complete after 2s [id=json-with-comments/README.md]
module.repositories["tokei-toukei"].data.github_repository_file.default_readme: Read complete after 2s [id=tokei-toukei/README.md]
module.repositories["devcontainer-features"].data.github_repository_file.default_readme: Read complete after 2s [id=devcontainer-features/README.md]
module.repositories["tfgh"].data.github_repository_file.default_readme: Read complete after 2s [id=tfgh/README.md]
module.repositories["dyson-rs"].data.github_repository_file.default_readme: Read complete after 2s [id=dyson-rs/README.md]
module.repositories["tokei-toukei"].github_repository_file.readme: Refreshing state... [id=tokei-toukei/README.md]
module.repositories["json-with-comments"].github_repository_file.readme: Refreshing state... [id=json-with-comments/README.md]
module.repositories["dyson-rs"].github_repository_file.readme: Refreshing state... [id=dyson-rs/README.md]
module.repositories["devcontainer-features"].github_repository_file.readme: Refreshing state... [id=devcontainer-features/README.md]
module.repositories["tfgh"].github_repository_file.readme: Refreshing state... [id=tfgh/README.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tokei-toukei/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tokei-toukei/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:43]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"83ddd45f6dfe36b426f4ea3cb2435f9dd8d06d8e78cab6de48ec1ed535883c73\"" -> "W/\"b6c72b14dbb5a6d8c641d9fe4e39edf68f8c7bfda64305ae1fb25b154a473f82\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"992b912b0072b962cefe93e8d26864022bc3e67ae024d3f4b9a7b671816ae840\"" -> "W/\"84c603c645de6fbe839cdc6541b9ae020358e0d1fa09e0a841cfdd77b3d28048\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"35530d13d1f4c11d4b3a97d449d4c8ce99c49a4c9506f4475e6829adf0f10f85\"" -> "W/\"15654d6cc76369debf425e1efabb6a92bff0592c954fc5d7f9092a9af0563035\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"2126fc406be325537b34352343da63accb06756f7cfdfed74723dab2cf2123ae\"" -> "W/\"029b77e28eb326a72220b9855d63fd8d2e473ef5179a1b6d037cb6e50c346858\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"304f7cf5784ca37e5a7374137eb50324659db4ec464b0b9ac8dc2fd56ff46448\"" -> "W/\"10d6ca8f8396fd6bea935280e5cb00ac257ac9570663375c6f01a1221cfb1751\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "dyson-rs"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "json-with-comments"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tfgh"
      + sha                          = (known after apply)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "main"
      + base_repository       = "tfgh"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "tokei-toukei"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Creation complete after 3s [id=tfgh/.github/issue_template.md]

Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":77,"Program":"tfcmt","SHA1":"5c04e8d30193b02717adec19caf6df406a8d8701","Vars":{},"WorkflowName":"Terraform apply on push"} -->